In [2]:
import pandas as pd
import numpy as np
from pandas import Series,DataFrame

In [3]:
frame1={'price':[20,19,18,17],'sales':[600,700,800,900]}
frame2=DataFrame(frame1)

print(frame2)

   price  sales
0     20    600
1     19    700
2     18    800
3     17    900

In [5]:
frame2.iloc[1]

price     19
sales    700
Name: 1, dtype: int64

In [8]:
pd.DataFrame(frame2.iloc[1]).reset_index()

   index    1
0  price   19
1  sales  700

In [7]:
type(frame2.iloc[1])

pandas.core.series.Series

In [6]:
frame2.iloc[2]['sales']

800

In [10]:
df1=pd.DataFrame({'price':[5,2,3,6],'sales':[10,20,30,40]},index=list('abcd'))

In [11]:
df1

   price  sales
a      5     10
b      2     20
c      3     30
d      6     40

In [14]:
df1.loc[['b','c']][['sales','price']]

   sales  price
b     20      2
c     30      3

In [10]:
df1.iloc[:,1]

a    10
b    20
c    30
d    40
Name: sales, dtype: int64

In [11]:
df1.iloc[:,[0,1]]

   price  sales
a      5     10
b      2     20
c      3     30
d      6     40

In [14]:
frame2.loc[[3,0]][['price']]

   price
3     17
0     20

In [3]:
df=pd.read_csv('https://cdn.upgrad.com/UpGrad/temp/f576c028-2da5-4a92-ae6b-d6d4d55a8400/EDA_Gold_Silver_prices.csv')
df.head()

    Month  SilverPrice  GoldPrice
0  Mar-97       186.48   12619.24
1  Apr-97       170.65   12338.59
2  May-97       170.44   12314.94
3  Jun-97       169.96   12202.78
4  Jul-97       155.80   11582.07

In [16]:
print(np.corrcoef(df.SilverPrice,df.GoldPrice))

[[1.         0.95425596]
 [0.95425596 1.        ]]

In [17]:
ccy=pd.read_csv('https://cdn.upgrad.com/UpGrad/temp/cbad0178-edd3-4120-bef2-104dd77a0065/currencies.csv')

In [18]:
np.corrcoef(ccy['Euro'],ccy['Indian Rupee'])

array([[ 1., nan],
       [nan, nan]])

In [19]:

inc=12000
inc1=40000

print("Adi started with"+str(inc)+"now his income is"+str(inc1))

list1=[['adi',50],['soma',34],['er',78]]

list1

Adi started with12000now his income is40000

[['adi', 50], ['soma', 34], ['er', 78]]

In [20]:

inc=12000
inc1=40000

print("Adi started with"+str(inc)+"now his income is"+str(inc1))

list1=[['adi',50],['soma',34],['er',78],['etr',340],['erte',56]]

list1

Adi started with12000now his income is40000

[['adi', 50], ['soma', 34], ['er', 78], ['etr', 340], ['erte', 56]]

In [21]:
ab=list1[0:3]
ab

[['adi', 50], ['soma', 34], ['er', 78]]

In [32]:
list2=["sumit",55000,"Amit",75000,"Tina",65000,"Hena",45000,"Reena",25000]
list2[0:2]=["Likith",60000]
list2
inc=["adi",230]
list_add=list2+inc
list_add

['Likith',
 60000,
 'Amit',
 75000,
 'Tina',
 65000,
 'Hena',
 45000,
 'Reena',
 25000,
 'adi',
 230]

In [33]:
list_add
del(list_add[0:2])
list_add

['Amit', 75000, 'Tina', 65000, 'Hena', 45000, 'Reena', 25000, 'adi', 230]

In [34]:
a = [0, 2, 3, 4, 5, 6, 7, 8, 9]
del(a[0:2])
a

[3, 4, 5, 6, 7, 8, 9]

In [35]:
c=range(11)
print(c)
print(list(c))

range(0, 11)
[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [36]:
python_structure=['lists','strings','dist','Boolean']
range(50)
Data_science='Data is new oil'
income=45000
price='Rs 25'

[x+1 for x in income]

TypeError: 'int' object is not iterable

In [37]:
a=[1,2,3,4]
b=['a','b','c','d']

[[x,y] for x in a for y in b if a.index(x)==b.index(y)]

[[1, 'a'], [2, 'b'], [3, 'c'], [4, 'd']]

In [38]:
sai=[]
for i in range(0,2):
    for j in range(3,5):
        sai.append([i,j])

In [39]:
sai=[]
for i in range(0,3):
    for j in range(3,6):
        sai.append([i,j])
        print(sai)

[[0, 3]]
[[0, 3], [0, 4]]
[[0, 3], [0, 4], [0, 5]]
[[0, 3], [0, 4], [0, 5], [1, 3]]
[[0, 3], [0, 4], [0, 5], [1, 3], [1, 4]]
[[0, 3], [0, 4], [0, 5], [1, 3], [1, 4], [1, 5]]
[[0, 3], [0, 4], [0, 5], [1, 3], [1, 4], [1, 5], [2, 3]]
[[0, 3], [0, 4], [0, 5], [1, 3], [1, 4], [1, 5], [2, 3], [2, 4]]
[[0, 3], [0, 4], [0, 5], [1, 3], [1, 4], [1, 5], [2, 3], [2, 4], [2, 5]]

In [40]:
pair2=[[i,j] for i in range(0,2) for j in range(3,6)]
print(pair2)

[[0, 3], [0, 4], [0, 5], [1, 3], [1, 4], [1, 5]]

In [41]:
t=(1,4,5,6)
print(t)

print(t[0])

(1, 4, 5, 6)
1

In [42]:
list1={'adi':50,'soma':34}

list1['adi']

50